УТ_для_edt/src/InformationRegisters/смартСформированныеУведомления/смартСформированныеУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСформированныеУведомления</name>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПолучателиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучателиКопии</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПолучателиКопииСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучателиСкрытые</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПолучателиСкрытыеСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Уведомление</name>
    <type>
      <types>CatalogRef.смартУведомления</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>СпособУведомления</name>
    <type>
      <types>EnumRef.смартСпособыУведомлений</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеПараметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Вложения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСпособыУведомлений/смартСпособыУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСпособыУведомлений</name>
  <enumValues>
    <name>Почта</name>
  </enumValues>
  <enumValues>
    <name>Телеграмм</name>
  </enumValues>
  <enumValues>
    <name>ЗадачаУТ</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеУТ</name>
  </enumValues>
  <enumValues>
    <name>ЛичноеСообщениеБ24</name>
    <comment>#5480 смарт: Тимофеева 28.01.26 / Рассылка уведомлений. Доработать систему для отправки уведомлений в Битрикс24</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/InformationRegisters/смартСформированныеУведомления/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		МассивВложений = ЗначениеИзСтрокиВнутр(Запись.Вложения);
		Если ТипЗнч(МассивВложений) = Тип("Массив") Тогда
			
			Для каждого стрВложение Из МассивВложений Цикл
				
				НоваяСтрока = ТаблицаВложений.Добавить();
				НоваяСтрока.Файл = стрВложение;
				
			КонецЦикла;
			
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если Запись.СпособУведомления = Перечисления.смартСпособыУведомлений.Почта Тогда
		
		Элементы.СтраницаЗадачаУТ.Видимость = Ложь;
		Элементы.СтраницаНапоминаниеУТ.Видимость = Ложь;
		Элементы.СтраницаТелеграм.Видимость = Ложь;
		
		Массив = ЗначениеИзСтрокиВнутр(Запись.Получатели);
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			
			Для каждого стрЗначение Из Массив Цикл
				
				НоваяСтрока = ТаблицаПолучателейПочта.Добавить();
				НоваяСтрока.Адрес = стрЗначение.Адрес;
				НоваяСтрока.Представление = стрЗначение.Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Массив = ЗначениеИзСтрокиВнутр(Запись.ПолучателиКопии);
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			
			Для каждого стрЗначение Из Массив Цикл
				
				НоваяСтрока = ТаблицаПолучателейКопииПочта.Добавить();
				НоваяСтрока.Адрес = стрЗначение.Адрес;
				НоваяСтрока.Представление = стрЗначение.Представление;
				
			КонецЦикла;
			
		КонецЕсли;

		
		Массив = ЗначениеИзСтрокиВнутр(Запись.ПолучателиСкрытые);
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			
			Для каждого стрЗначение Из Массив Цикл
				
				НоваяСтрока = ТаблицаПолучателейСкрытыеПочта.Добавить();
				НоваяСтрока.Адрес = стрЗначение.Адрес;
				НоваяСтрока.Представление = стрЗначение.Представление;
				
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли Запись.СпособУведомления = Перечисления.смартСпособыУведомлений.НапоминаниеУТ Тогда
		
		Элементы.СтраницаЗадачаУТ.Видимость = Ложь;
		Элементы.СтраницаПочта.Видимость = Ложь;
		Элементы.СтраницаТелеграм.Видимость = Ложь;
		
		Массив = ЗначениеИзСтрокиВнутр(Запись.Получатели);
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			
			Для каждого стрЗначение Из Массив Цикл
				
				НоваяСтрока = ТаблицаПолучателейНапоминание.Добавить();
				НоваяСтрока.Пользователь = стрЗначение;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
